task_dict = {
    '1组织健全':
        {
            '11规范设置':
                [
                    {
                        'details': '111高校学生党支部在按年级或院（系）、专业设置的基础上，根据实际需要，探索按照重大项目组、课题组和学生公寓、社区、社团组织等设置。',
                        'kind': 'B'
                    },
                    {
                        'details': u'112正式党员3人以上应建立党支部，党支部党员人数一般不超过30人。党员7人以上的党支部设立支部委员会，支部委员会由党员大会选举产生；党员不足7人的党支部，不设支部委员会，由党员大会选举支部书记1人，必要时增选副书记1人。正式党员不足3人的，可以与相近年级或院（系）联合成立党支部。凡有正式党员3人以上的，学校安排见习、实习时间较短，或由于某种原因暂时不能成立正式党支部的，应该成立临时党支部；不足3名正式党员的，可临时编入见习、实习单位党支部，参加组织生活。',
                        'kind': 'A'
                    },
                    {
                        'details': '113党员人数较多的党支部，按照“便于党员活动、便于加强管理、便于发挥作用”的原则，合理划分党小组。',
                        'kind': 'C'
                    },
                ],
            '12配强班子':
                [
                    {
                        'details': '121选优配强党支部书记，注重从优秀辅导员、骨干教师、优秀大学生党员中选拔学生党支部书记，对不称职的党支部书记及时进行调整。',
                        'kind': 'A'
                    },
                    {
                        'details': '122按照院（系）、年级、专业或师生互补原则合理选配支委会成员，做到班子成员分工明确，整体功能充分发挥。',
                        'kind': 'C'
                    },
                ],
            '13按期换届':
                [
                    {
                        'details': '131党的支部委员会和不设支部委员会的支部书记、副书记每届任期2年或3年。',
                        'kind': 'B'
                    },
                    {
                        'details': '132党支部按规定时限进行换届选举，选出的委员报上级党组织备案，选出的书记、副书记报上级党组织批准。委员出现空缺及时补选。',
                        'kind': 'A'
                    },
                ],
        },
    '2制度完善':
        {
            '21坚持三会一课制度':
                [
                    {
                        'details': '211每季度召开1次支部党员大会，传达贯彻上级党组织决议指示、发展党员、进行党内选举、表彰和处分党员、听取支部委员会报告工作，讨论和决定其他重大问题。',
                        'kind': 'A'
                    },
                    {
                        'details': '212每月召开1次支部委员会议，研究提出落实上级党组织部署任务和支部党员大会决定的具体措施，确定提交支部党员大会讨论决定的事项，讨论处理支部日常工作。',
                        'kind': 'C'
                    },
                    {
                        'details': '213每月召开1次党小组会（不设党小组的支部召开支部大会），组织党员学习交流，听取党员思想工作汇报，讨论党务工作事项，研究执行支部决定和工作任务的具体办法。',
                        'kind': 'C'
                    },
                    {
                        'details': '214每季度至少上一次党课，党支部书记每年至少上1次党课，党员领导干部要定期到党支部讲党课。',
                        'kind': 'A'
                    },
                ],
            '22坚持组织生活会制度':
                [
                    {
                        'details': '221围绕解决党性党风党纪学风存在的问题，每年至少召开1次党支部组织生活会。',
                        'kind': 'A'
                    },
                    {
                        'details': '222院（系）党组织负责人参加学生支部组织生活会，指导开展批评与自我批评。',
                        'kind': 'C'
                    },
                ],
            '23坚持民主评议党员制度':
                [
                    {
                        'details': '231结合年终工作考核或年度组织生活会，按照个人自评、党员互评、民主测评、组织评定的程序，对党员进行民主评议，确定党员评议等次。',
                        'kind': 'A'
                    },
                    {
                        'details': '232每年组织学生对党支部和党员进行一次满意度测评，查清存在问题，认真进行整改。',
                        'kind': 'C'
                    },
                ],
            '24坚持联系服务群众制度':
                [
                    {
                        'details': '241建立困难党员和群众关心帮扶机制，积极开展服务承诺、结对帮扶、走访慰问等活动，发挥党员先锋模范作用。',
                        'kind': 'B'
                    },
                    {
                        'details': '242及时听取和反映学生意见和建议，定期分析本单位群众思想状况，帮助学生解决实际困难。',
                        'kind': 'C'
                    },
                ],
            '25坚持谈心谈话制度':
                [
                    {
                        'details': '251党支部书记每半年与所在支部的党员谈心不少于1次。',
                        'kind': 'A'
                    },
                    {
                        'details': '252支部党员采取个别谈话、集体座谈等方式，开展经常性的谈心谈话，坦诚相见，交流思想，交换意见。',
                        'kind': 'C'
                    },
                ],
            '26坚持经常性提醒和批评制度':
                [
                    {
                        'details': '261对不经常参加组织生活、不按期交纳党费、不认真完成党组织交办的任务、党员意识和党的意识淡化、先锋作用发挥不好的党员，及时进行提醒和帮助。',
                        'kind': 'B'
                    },
                    {
                        'details': '262党员要经常开展批评和自我批评，敢于正视、深刻剖析、主动改正自己的缺点错误；对同志的缺点错误应当敢于指出，帮助改进，让咬耳扯袖、红脸出汗成为常态。',
                        'kind': 'C'
                    },
                ],
            '27坚持和完善党日制度':
                [
                    {
                        'details': '271以学校为单位，每月相对固定一天作为党员活动日，开展组织生活、进行党的教育、召开党的会议、处理党务工作、党员交纳党费。',
                        'kind': 'A'
                    },
                    {
                        'details': '272结合支部实际，开展主题党日活动，争创特色党日、创新党日，增强党日活动的政治性、思想性、针对性、实效性。',
                        'kind': 'B'
                    },
                ],
            '28坚持请示报告制度':
                [
                    {
                        'details': '281党支部一般每学期末向上级党组织报告1次支部工作，每年向支部党员大会报告工作情况，党支部发生的重大事项及时向上级党组织报告。',
                        'kind': 'A'
                    },
                    {
                        'details': '282党员一般每半年向党支部汇报1次学习、思想和工作情况，包括履行党员义务、发挥先锋模范作用、开展思想政治工作等情况。',
                        'kind': 'B'
                    },
                    {
                        'details': '283党员个人离开和返回学校所在城市要向支部报告。',
                        'kind': 'C'
                    },
                    {
                        'details': '284党支部及时向本单位党员和群众通报党内重大事项。',
                        'kind': 'C'
                    },
                ],
        },
    '3运行规范':
        {
            '31支部工作规范开展':
                [
                    {
                        'details': '311党支部工作有计划有检查有考核有总结。',
                        'kind': 'B'
                    },
                    {
                        'details': '312坚持民主集中制原则，支部重大问题由支委会或党员大会集体讨论决定。',
                        'kind': 'B'
                    },
                    {
                        'details': '313党支部书记每年向上级党组织述职1次，向本支部全体党员报告1次工作，自觉接受监督。',
                        'kind': 'A'
                    },
                    {
                        'details': '314定期检查党员参加党的组织生活情况，督促党员过好组织生活。',
                        'kind': 'C'
                    },
                    {
                        'details': '315党员外出学习、实习时间较长的，应按有关规定，参加所在地党组织的组织生活。',
                        'kind': 'C'
                    },
                ],
            '32队伍建设规范进行':
                [
                    {
                        'details': '321严格执行《中国共产党发展党员工作细则》，把政治标准放在首位，严格程序要求，做好发展党员工作。积极培养优秀学生入党。',
                        'kind': 'A'
                    },
                    {
                        'details': '322党员每年参加党组织安排的各类集中培训一般不少于32学时。支部书记和支委会成员每年参加党组织安排的集中培训一般不少于56学时。其中，参加“三会一课”、经学校党委认定的网络学习时间计入学时。',
                        'kind': 'B'
                    },
                    {
                        'details': '323加强对党员的日常教育管理，做好党员队伍统计分析、组织关系接转和流动党员管理工作，及时妥善处置不合格党员。',
                        'kind': 'B'
                    },
                    {
                        'details': '324按照党费收缴规定，支部党员自觉、按时、足额交纳党费。',
                        'kind': 'A'
                    },
                ],
        },
    '4活动经常':
        {
            '41健全活动机制':
                [
                    {
                        'details': '411落实党支部组织生活的各项规章制度，建立健全活动机制，全年党支部组织生活不少于12次。',
                        'kind': 'A'
                    },
                    {
                        'details': '412定期组织党员开展政治理论学习，及时了解掌握党员思想状况，有针对性地做好思想政治工作。',
                        'kind': 'B'
                    },
                    {
                        'details': '413利用重大节日、纪念日和重要时间节点，有组织地开展表彰座谈、走访慰问、学习纪念、党性锻炼等活动，丰富党组织生活内涵。',
                        'kind': 'C'
                    },
                    {
                        'details': '414积极组织参加上级党组织面向党员举办的各类活动。',
                        'kind': 'C'
                    },
                ],
            '42建设活动阵地':
                [
                    {
                        'details': '421学校院（系）党委（党总支）应建设开放式的党员活动室，设立醒目的“党员活动室”或“共产党员之家”等标识牌，供各党支部使用。',
                        'kind': 'A'
                    },
                    {
                        'details': '422党员活动室应悬挂党旗，以及入党誓词、党员的权利和义务、“三会一课”制度、党支部组织机构、党支部荣誉栏。',
                        'kind': 'B'
                    },
                    {
                        'details': '423党员活动室因地制宜设置宣传栏，配备资料橱（或书柜）和报刊架，购置并定期更新报刊、党建杂志和相关书籍（有条件的，可配备投影仪、电脑、电视等设备），并指派专人管理，各类台账及记录标识统一，分类摆放。',
                        'kind': 'C'
                    },
                ],
            '43提供经费保障':
                [
                    {
                        'details': '431按照学生党员人均每年不低于100元的标准核定党支部工作活动经费，列入学校经费预算。',
                        'kind': 'A'
                    },
                    {
                        'details': '432加强党建经费管理，遵守财务制度，提高使用效益，做到专款专用。',
                        'kind': 'B'
                    },
                ],
        },
    '5档案齐全':
        {
            '51规范党员信息台账':
                [
                    {
                        'details': '511建立党支部党员名册、入党积极分子名册、发展对象名册，认真填写，及时更新，规范使用。',
                        'kind': 'A'
                    },
                    {
                        'details': '512建立党员档案，规范地记录支部党员个人基本情况及参加教育培训、奖惩、廉洁自律等方面的情况。',
                        'kind': 'B'
                    },
                    {
                        'details': '513建立入党积极分子档案，规范记录入党积极分子、重点培养对象的基本情况，以及培养培训等方面的情况。',
                        'kind': 'C'
                    },
                    {
                        'details': '514建立困难党员档案，详细记录困难党员基本情况、主要帮扶措施等。',
                        'kind': 'C'
                    },
                ],
            '52规范组织生活台账':
                [
                    {
                        'details': '521统一规范使用《党支部组织生活记录本》，明确专人负责记录。',
                        'kind': 'B'
                    },
                    {
                        'details': '522规范记录“三会一课”等组织生活情况，记录开展党员主题党日活动、召开组织生活会、民主评议党员等党支部工作和活动开展情况。',
                        'kind': 'A'
                    },
                    {
                        'details': '523党支部年度工作计划、任务分工、工作总结、党课讲稿、相关会议或活动材料齐全。',
                        'kind': 'B'
                    },
                ],
            '53规范联系服务群众台账':
                [
                    {
                        'details': '531建立党员联系和服务群众名册，记录相关党员和群众姓名、单位、职务（职称）等基本情况。',
                        'kind': 'B'
                    },
                    {
                        'details': '532记录联系服务群众的时间、地点、具体内容，以及工作成效等情况。',
                        'kind': 'C'
                    },
                ],
            '54规范党费收缴使用台账':
                [
                    {
                        'details': '541规范使用党费收缴簿和党费证，记录支部每名党员缴纳党费的标准、时间、金额情况。',
                        'kind': 'B'
                    },
                    {
                        'details': '542规范记录党费使用的用途、金额等情况。',
                        'kind': 'C'
                    },
                ],
        },
    '6作用突出':
        {
            '61支部战斗堡垒作用充分发挥':
                [
                    {
                        'details': '611积极实施“校园先锋工程”，组织党员开展 “一访二联三谈”和“亮身份树形象作贡献”活动，创建“校园先锋岗”。',
                        'kind': 'A'
                    },
                    {
                        'details': '612在党员思想政治教育、管理、服务工作中针对性实效性强，在推进专业学习、志愿服务、社会实践、就业创业等方面工作有力。',
                        'kind': 'B'
                    },
                    {
                        'details': '613在引领优良班风、校风、学风、践行社会主义核心价值观和维护学校改革发展稳定大局中发挥战斗堡垒作用。',
                        'kind': 'B'
                    },
                ],
            '62党员先锋模范作用突出':
                [
                    {
                        'details': '621严格遵守党章与党纪党规，带头遵守国家法律和校纪校规，带头践行社会主义核心价值观，做“勤学、修德、明辨、笃实”的表率。',
                        'kind': 'B'
                    },
                    {
                        'details': '622带头落实“政治合格、执行纪律合格、品德合格、发挥作用合格”的要求，做党的路线方针政策的宣传者，做朋辈帮扶、互助友爱的践行者，做就业创业、志愿服务国家需要的争先者，做钻研科学知识、勇攀科学高峰的探索者。',
                        'kind': 'B'
                    },
                    {
                        'details': '623在学术研究、恪守学术道德中的模范带头作用发挥充分，毕业生党员在就业创业中的导向和示范作用突出。',
                        'kind': 'C'
                    },
                    {
                        'details': '624参加党的活动时佩戴“共产党员”徽章，在寝室摆放“共产党员”标志牌，亮明党员身份，发挥先锋模范作用。',
                        'kind': 'A'
                    },
                ],
        },
    '7附加项目':
        {
            '71工作创新':
                [
                    {
                        'details': '711积极推进党支部工作创新，工作有特色、有成效，其经验做法在全校范围推广。',
                        'kind': '☆'
                    },
                    {
                        'details': '712积极推进党支部工作创新，工作有特色、有成效，其经验做法在省及以上范围推广。',
                        'kind': '☆☆'
                    }
                ],
            '72所获荣誉':
                [
                    {
                        'details': '721党支部战斗堡垒作用和党员先锋模范作用突出，党支部、支部党员或支部所在单位获学校表彰。',
                        'kind': '☆'
                    },
                    {
                        'details': '722党支部战斗堡垒作用和党员先锋模范作用突出，党支部、支部党员或支部所在单位获省级及以上表彰。',
                        'kind': '☆☆'
                    },
                ],
        }
}

if __name__ == '__main__':
    # print(task_dict)
    count = 0
    for task_name_first in task_dict.keys():
        # print(task_name_first)

        for task_name_second in task_dict[task_name_first]:
            # print(task_name_second)

            for task_name_third in task_dict[task_name_first][task_name_second]:
                print(task_name_third['details'])
                count += 1
    print(count)
